app/Models/MahasiswaModel.php

SELECT *
FROM `mahasiswa`
SELECT *
FROM `mahasiswa`
WHERE `mahasiswa`.`id` = '1'
---
    public function getData($id = null)
    {
        if ($id == null) {
            return $this->findAll();
        } else {
            $data = $this->find($id);

INSERT INTO `mahasiswa` (`nim`, `nama`, `jurusan`, `alamat`) VALUES ('1233764859', 'Arifin', 'Teknik Mesin', 'Ungaran')
---
    public function insertData($data)
    {
        return $this->insert($data);

UPDATE `mahasiswa` SET `id` = '1', `nim` = '1233987265', `nama` = 'Teguh Pamungkas', `jurusan` = 'Teknik Informatika', `alamat` = 'Semarang'
WHERE `mahasiswa`.`id` IN ('1')
---
    public function updateData($id, $data)
    {
        return $this->update($id, $data);

DELETE FROM `mahasiswa`
WHERE `id` IN ('1')
---
    public function deleteData($id)
    {
        return $this->delete($id);